Ran Plan for 2 projects:

1. project: `seed` dir: `seed` workspace: `default`
1. project: `frontend` dir: `frontend` workspace: `default`

### 1. project: `seed` dir: `seed` workspace: `default`
<details><summary>Show Output</summary>

```diff

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_compute_instance.seed001 must be replaced
-/+ resource "google_compute_instance" "seed001" {
        can_ip_forward          = false
      ~ cpu_platform            = "Intel Broadwell" -> (known after apply)
      ~ current_status          = "RUNNING" -> (known after apply)
        deletion_protection     = false
      - enable_display          = false -> null
      ~ guest_accelerator       = [] -> (known after apply)
      ~ id                      = "projects/heroic-muse-289316/zones/us-west1-a/instances/dm-seed1-6e291ed314bc831a" -> (known after apply)
      ~ instance_id             = "1680370789545211598" -> (known after apply)
      ~ label_fingerprint       = "42WmSpB8rSM=" -> (known after apply)
      - labels                  = {} -> null
        machine_type            = "f1-micro"
        metadata                = {
            "ssh-keys" = <<~EOT
                dmalicia:ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQCobuzwfxuNnlZUgmPqHdSLj6+s6giPOfCCfi2UjHpuzMr5/cRS0HxZBem2A0cyNcbPiG+WIsnd+jocrqE+WlaioLZwXWPbQ4OAYeZb0yibfks/jG6GMszyyN1qg2davPogsTPlwFQubnWb1HTZiz2K58OcKETuv3mJLGqZsRsIai/Trvx7TLax5YHnVYTdM8fEfGCiByWjpU2g+cpPHe2qcSWjoMm9ThMW/jZ5Xc68HnSdap4X37SaP29SRN3AqA464efYMgZzEuIe0aHFwA9pkwXCS+NDWZx8VTRSJIkpvLzpjzrLrBFh/w6ECZlwHXI4KcP28B92otcfM+Tot+wzWxEitT22VaRBNrXwwExxqC4IC4ZxL5pxxpydy04GsraShjgcA3hxEh1YJl4BZud3Na9KtdimQ7CPzgKwsHaPTtb1QCWDdCsoDW5PW7Cz4029CruVwP13Mkm8sK0ja59m7uH8lpIi2SVMnOS6YkZfxN7/9IVHgNDnd4OYi2HR84hVTs6578HFhft3jdE6j5TVyQLXK/PLxZJKlXO7EkIGvytjW+1XOeGFywB7l9l2G4aSAN1CBertde4J8vyPwv0SqWW684TuoGj5hxfFU3XoQpFlDbN2QH2fm3oExMxzfFMRTM6cyJa410/w6lZswsWC1Wonf6juVw1P3RSY0uDEcw== root@sandworm
            EOT
        }
      ~ metadata_fingerprint    = "rq7LtIxnzJs=" -> (known after apply)
      ~ metadata_startup_script = <<~EOT # forces replacement
            sudo apt-get update;
          - sudo apt-get install -yq build-essential python-pip rsync software-properties-common apt-transport-https unzip;
          + sudo apt-get install -yq build-essential python-pip rsync software-properties-common apt-transport-https;
            curl -fsSL https://download.docker.com/linux/debian/gpg | sudo apt-key add -;
            A=`lsb_release -cs`;
          + echo "fim" >> /tmp/meio;
            sudo add-apt-repository "deb [arch=amd64] https://download.docker.com/linux/debian $A stable";
            sleep 3
            sudo apt-get update
            sudo apt-get -yq install docker-ce docker-ce-cli containerd.io;
            sleep 10;
            echo "sleep 10" >> /tmp/meio;
            docker run -d --name atlantis -p 4141:4141 runatlantis/atlantis server --gh-user=dmalicia --gh-token=672d727d71584c0ab17e6bc5a80ca77298a99147 --repo-allowlist github.com/dmalicia/dm-terraform --repo-config=/repos.yaml;
            
            echo "sleep docker is up?" >> /tmp/meio;
            git clone https://github.com/dmalicia/dm-terraform.git /usr/local/share/dm-terraform/
            docker cp /usr/local/share/dm-terraform/seed/bootstrap/initdm.sh atlantis:/
            docker cp /usr/local/share/dm-terraform/seed/bootstrap/repos.yaml atlantis:/
            docker restart atlantis
            cat >> /config.yml <<EOF
            web_addr: localhost:41414
            tunnels:
              atlantis:
                addr: 4141
                bind_tls: true
                proto: http
            EOF
          - wget https://bin.equinox.io/c/4VmDzA7iaHb/ngrok-stable-linux-amd64.zip /
          - unzip /ngrok-stable-linux-amd64.zip 
          - ./ngrok start atlantis --config /config.yml -log=/tmp/klog > /dev/null &
          - wget https://apt.puppetlabs.com/puppetlabs-release-trusty.deb /
          - sleep 10
          - sudo dpkg -i /puppetlabs-release-trusty.deb
          - echo "instalou?" >> /tmp/meio;
          - sudo apt-get update
          - sudo apt-get install puppetmaster-passenger -yq
          - sudo puppet master
          + wget https://bin.equinox.io/c/4VmDzA7iaHb/ngrok-stable-linux-amd64.zip
          + unzip ngrok-stable-linux-amd64.zip /
          + ngrok start atlantis --config /config.yml -log=/tmp/klog > /dev/null &
        EOT
      + min_cpu_platform        = (known after apply)
        name                    = "dm-seed1-6e291ed314bc831a"
      ~ project                 = "heroic-muse-289316" -> (known after apply)
      - resource_policies       = [] -> null
      ~ self_link               = "https://www.googleapis.com/compute/v1/projects/heroic-muse-289316/zones/us-west1-a/instances/dm-seed1-6e291ed314bc831a" -> (known after apply)
      - tags                    = [] -> null
      ~ tags_fingerprint        = "42WmSpB8rSM=" -> (known after apply)
        zone                    = "us-west1-a"

      ~ boot_disk {
            auto_delete                = true
          ~ device_name                = "persistent-disk-0" -> (known after apply)
          + disk_encryption_key_sha256 = (known after apply)
          + kms_key_self_link          = (known after apply)
            mode                       = "READ_WRITE"
          ~ source                     = "https://www.googleapis.com/compute/v1/projects/heroic-muse-289316/zones/us-west1-a/disks/dm-seed1-6e291ed314bc831a" -> (known after apply)

          ~ initialize_params {
              ~ image  = "https://www.googleapis.com/compute/v1/projects/debian-cloud/global/images/debian-9-stretch-v20200910" -> "debian-cloud/debian-9"
              ~ labels = {} -> (known after apply)
              ~ size   = 10 -> (known after apply)
              ~ type   = "pd-standard" -> (known after apply)
            }
        }

      ~ network_interface {
          ~ name               = "nic0" -> (known after apply)
          ~ network            = "https://www.googleapis.com/compute/v1/projects/heroic-muse-289316/global/networks/default" -> "default"
          ~ network_ip         = "10.138.0.30" -> (known after apply)
          ~ subnetwork         = "https://www.googleapis.com/compute/v1/projects/heroic-muse-289316/regions/us-west1/subnetworks/default" -> (known after apply)
          ~ subnetwork_project = "heroic-muse-289316" -> (known after apply)

          ~ access_config {
                nat_ip       = "35.233.219.1"
              ~ network_tier = "PREMIUM" -> (known after apply)
            }
        }

      ~ scheduling {
          ~ automatic_restart   = true -> (known after apply)
          ~ on_host_maintenance = "MIGRATE" -> (known after apply)
          ~ preemptible         = false -> (known after apply)

          + node_affinities {
              + key      = (known after apply)
              + operator = (known after apply)
              + values   = (known after apply)
            }
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p seed`
* :put_litter_in_its_place: To **delete** this plan click [here](http://514893b38417:4141/lock?id=dmalicia%252Fdm-terraform%252Fseed%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p seed`
</details>

---
### 2. project: `frontend` dir: `frontend` workspace: `default`
**Plan Error**
<details><summary>Show Output</summary>

```
running "/usr/local/bin/terraform init -input=false -no-color -upgrade" in "/home/atlantis/.atlantis/repos/dmalicia/dm-terraform/5/default/frontend": exit status 1
There are some problems with the configuration, described below.

The Terraform configuration must be valid before initialization so that
Terraform can determine which modules and providers need to be installed.

Error: Invalid resource name

  on main.tf line 20, in resource "google_compute_instance" "frontend-${ ... }":
  20: resource "google_compute_instance" "frontend-${random_id.instance_id.hex}" {

A name must start with a letter or underscore and may contain only letters,
digits, underscores, and dashes.


Error: Invalid string literal

  on main.tf line 20, in resource "google_compute_instance" "frontend-${ ... }":
  20: resource "google_compute_instance" "frontend-${random_id.instance_id.hex}" {

Template sequences are not allowed in this string. To include a literal "$",
double it (as "$$") to escape it.


```
</details>

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
